ventanilla_unica_Web_servicec_scraping/ad.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:con="http://www.ventanillaunica.gob.mx/pedimentos/ws/oxml/consultarremesas"
        xmlns:com="http://www.ventanillaunica.gob.mx/pedimentos/ws/oxml/comunes">
        <soapenv:Header>
                <wsse:Security soapenv:mustUnderstand="1"
                        xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
                        <wsse:UsernameToken>
                                <wsse:Username>%1</wsse:Username>
                                <wsse:Password
                                        Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">
                                        %2</wsse:Password>
                        </wsse:UsernameToken>
                </wsse:Security>
        </soapenv:Header>
        <soapenv:Body>
                <con:consultarRemesasPeticion>
                        <con:numeroOperacion>%3</con:numeroOperacion>
                        <con:peticion>
                                <com:aduana>%4</com:aduana>
                                <com:patente>%5</com:patente>
                                <com:pedimento>%6</com:pedimento>
                        </con:peticion>
                </con:consultarRemesasPeticion>
        </soapenv:Body>
</soapenv:Envelope>